test/fixtures/vcr_cassettes/europepmc.json

[
  {
    "request": {
      "body": "<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><P:searchPublications xmlns:P=\"https://www.europepmc.org/data\"><queryString>7</queryString><resultType>nonexistent</resultType></P:searchPublications></soap:Body></soap:Envelope>",
      "headers": {
        "Content-Type": "text/xml; encoding=utf-8",
        "SOAPAction": ""
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://www.ebi.ac.uk:443/europepmc/webservices/soap"
    },
    "response": {
      "binary": false,
      "body": "<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\"><S:Body><S:Fault xmlns:ns4=\"http://www.w3.org/2003/05/soap-envelope\"><faultcode>S:Client</faultcode><faultstring>Cannot find dispatch method for {https://www.europepmc.org/data}searchPublications</faultstring></S:Fault></S:Body></S:Envelope>",
      "headers": {
        "Server": "Apache-Coyote/1.1",
        "Content-Type": "text/xml;charset=utf-8",
        "Strict-Transport-Security": "max-age=0",
        "Date": "Fri, 27 Apr 2018 08:38:45 GMT",
        "Transfer-Encoding": "chunked",
        "Connection": "close"
      },
      "status_code": 500,
      "type": "ok"
    }
  }
]